package com.geoniljang.funtion

/*
* 코틀린은 다중패러다임 언어
* 함수형 프로그래밍
*  - 프로그램을 모듈화 해 디버깅하거나 테스트가 쉬움
*  - 간략한 표션식을 사용해 생산성이 높음
*  - 람다식과 고차함수를 사용하면서 다양한 함수 조합을 사용할 수 있음
*  - 코드 간략, 테스트나 재사용성 증가
*  - 람다식, 고차 함수를 사용해 구성
*    -> 람다식 이란? {x,y -> x+Y}
*        1) 익명 함수의 하나아의 형태로 이름 없이 사용 및 실행이 가능
*        2) 람다 대수로 부터 유래
*        3) 람다식은 고차 함숭서 인자로 넘기거나 결과값으로  반환 등을 할 수 있다.
*        4) -> 화살표를 사용
*    -> 일급객체란?
*        1) 일급 객체는 함수의 인자로 전달할 수 있다.
*        2) 일급 객체는 함수의 반환값에 사용할 수 있다.
*        3) 일극 갭체는 변수에 담을 수 있다.
*    -> 고차함수란?
*        1) 다른 함수를 매개변수, 반환 값에 이용이 가능
*        2) fun myfun(sum: (Int, Int)->Int){ }
*  - 순수 함수 (부작용이 없는함수)
*     -> 부작용
*        1) 동일한 입력 인자에 대해서는 항상 같은 결과를출력 혹은 반환 한다.
*        2) 값이 예측이 가능해 결정적이다.

*
*
*
*
* 객체 지향 프로그래밍 oop
*
*
*
* */

